Revit 2026 API

# PlasticVinylPlasticvinylType Property

---

The property labeled "Type" from the "PlasticVinyl" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string PlasticvinylType { get; }
```
```vb
Public Shared ReadOnly Property PlasticvinylType As String
	Get
```
```cpp
public:
static property String^ PlasticvinylType {
	String^ get ();
}
```
```fsharp
static member PlasticvinylType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "PlasticvinylType".

#### Reference

PlasticVinyl Class

Autodesk.Revit.DB.Visual Namespace